app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "post_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["post_id", 5], ["content", "You know it!"], ["created_at", "2017-08-05 20:28:23.157446"], ["updated_at", "2017-08-05 20:28:23.157446"]]
---
  def create
    @comment = @post.comments.build(comment_params)
    @comment.user_id = current_user.id

    if @comment.save