app/controllers/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "caption" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["caption", "Trip out on that, man."], ["updated_at", "2017-08-02 18:53:06.667752"], ["id", 1]]